In [2]:
import pandas as pd

# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect, func, distinct

# Import password authentication for the postgresql database
from config import password

### Connect to local database

In [4]:
# Create Engine and connection
engine = create_engine(f"postgresql://postgres:{password}@localhost:5432/fast_food_census_db")

In [5]:
engine.table_names()

[]

### Use pandas to load csv-converted dataframe into database

In [6]:
census_df = pd.read_csv("../02_transform_census/clean_census.csv", dtype={'ZCTA': 'str'})
census_df.head()

,ZCTA,population,median_age,median_household_income,per_capita_income,poverty_count,unemployment_count
0,00601,17242,40.5,13092.0,6999.0,10772,2316
1,00602,38442,42.3,16358.0,9277.0,19611,1927
2,00603,48814,41.1,16603.0,11307.0,24337,3124
3,00606,6437,43.3,12832.0,5943.0,4163,230
4,00610,27073,42.1,19309.0,10220.0,11724,1290

In [7]:
census_df.to_sql(name='social_economics', con=engine, if_exists="append", index=False)

In [8]:
restaurant_df = pd.read_csv("../02_transform_restaurant/restaurant_id.csv")
restaurant_df.head()

   restaurant_id restaurant_name
0              1  SONIC Drive In
1              2       Taco Bell
2              3          Arby's
3              4  Steak 'n Shake
4              5         Wendy's

In [9]:
restaurant_df.to_sql(name='restaurant', con=engine, if_exists="append", index=False)

In [11]:
zcta_df = pd.read_csv("../02_transform_zip_zcta/zcta.csv", dtype='str')
zcta_df.head()

  zip_code   ZCTA
0    00501  11742
1    00544  11742
2    00601  00601
3    00602  00602
4    00603  00603

In [12]:
zcta_df.to_sql(name="zcta", con=engine, if_exists="append", index=False)

In [13]:
zip_code_df = pd.read_csv("../02_transform_restaurant/zip_code.csv", dtype='str')
zip_code_df.head()

  zip_code          city state
0    70301     Thibodaux    LA
1    37863  Pigeon Forge    TN
2    30260        Morrow    GA
3    48204       Detroit    MI
4    48235       Detroit    MI

In [14]:
zip_code_df.to_sql(name='zip_code', con=engine, if_exists="append", index=False)

In [10]:
restaurant_address_df = pd.read_csv("../02_transform_restaurant/restaurant_address.csv", dtype={'zip_code': 'str'})
restaurant_address_df.head()

   restaurant_id street_no   street_name zip_code
0              1       800  N Canal Blvd    70301
1              1       124     John R Rd    48083
2              1       909        N Wood    75644
3              1        97  Gateway Blvd    82901
4              1      6557  S Staples St    78413

In [11]:
restaurant_address_df.to_sql(name='restaurant_address', con=engine, if_exists="append", index=False)

In [12]:
zcta_df = pd.read_csv("../02_transform_zip_zcta/zcta.csv", dtype='str')
zcta_df.head()

  zip_code   ZCTA
0    00501  11742
1    00544  11742
2    00601  00601
3    00602  00602
4    00603  00603

In [ ]:
pd.read_csv("../02_transform_zip_zcta")

### Reflect Tables into SQLAlchemy ORM

In [ ]:
# reflect an existing database into a new model
Base = automap_base()

# reflect the tables
Base.prepare(engine, reflect=True)

In [ ]:
engine.table_names()

### Import the csv files

### Load DataFrames into database